PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_ethif.h
/***************************************
*        Enumerations
***************************************/

/**
* \addtogroup group_ethif_enums
* \{
*/

/**
 *****************************************************************************
 ** \brief Ethernet MAC driver error codes.
 **
 *****************************************************************************/
typedef enum
{
    CY_ETHIF_SUCCESS = 0U,               /**< Returned successful */
    CY_ETHIF_BAD_PARAM,                 /**< Bad parameter was passed */
    CY_ETHIF_MEMORY_NOT_ENOUGH,         /**< Assigned memory for BDs not enough */
    CY_ETHIF_LINK_DOWN,                 /**< Link between nodes is not up */
    CY_ETHIF_LINK_UP,                   /**< Link between nodes is up */
    CY_ETHIF_BUFFER_NOT_AVAILABLE,      /**< No local buffer available to send the frame */
} cy_en_ethif_status_t;


/**
 *****************************************************************************
 ** \brief Ethernet MAC driver buffer status.
 **
 *****************************************************************************/
typedef enum
{
    CY_ETHIF_BUFFER_UNINIT = 0U,         /**< Buffer Uninitialized */
    CY_ETHIF_BUFFER_FREE,               /**< Buffer free and cleared with CY_EHTIF_EMPTYVALUE */
    CY_ETHIF_BUFFER_OCCUPIED,           /**< Buffer has been allocated to BD or in case of Tx loaded with the source data */
    CY_ETHIF_BUFFER_RELEASED,           /**< Buffer has been used and can be written with CY_EHTIF_EMPTYVALUE */
} cy_en_ethif_buffer_status_t;


/**
 *****************************************************************************
 ** \brief Ethernet MAC Drive Modes.
 **
 *****************************************************************************/
typedef enum
{
    CY_ETHIF_CTL_MII_10         = 0U,    /**< PHY mode  MII - 10Mbps */
    CY_ETHIF_CTL_MII_100        = 1U,    /**< PHY mode  MII - 100Mbps */
    CY_ETHIF_CTL_GMII_1000      = 2U,    /**< PHY mode  GMII - 1000Mbps */
    CY_ETHIF_CTL_RGMII_10       = 3U,    /**< PHY mode  RGMII - 10Mbps (4bits/Cycle) */
    CY_ETHIF_CTL_RGMII_100      = 4U,    /**< PHY mode  RGMII - 100Mbps (4bits/Cycle) */
    CY_ETHIF_CTL_RGMII_1000     = 5U,    /**< PHY mode  RGMII - 1000Mbps (8bits/Cycle) */
    CY_ETHIF_CTL_RMII_10        = 6U,    /**< PHY mode  RMII - 10Mbps */
    CY_ETHIF_CTL_RMII_100       = 7U,    /**< PHY mode  RMII - 100Mbps */
} cy_en_ethif_speed_sel_t;


/**
 *****************************************************************************
 ** \brief Reference Clock for RMII/RGMII.
 **
 *****************************************************************************/
typedef enum
{
    CY_ETHIF_EXTERNAL_HSIO = 0U,         /**< Clock coming from HSIO */
    CY_ETHIF_INTERNAL_PLL,              /**< Clock referenced from Internal PLL source */
} cy_en_ethif_clock_ref_t;


/**
 *****************************************************************************
 ** \brief MAC filter types
 **
 *****************************************************************************/
typedef enum
{
    CY_ETHIF_FILTER_TYPE_DESTINATION = 0U, /**< filter on destination address */
    CY_ETHIF_FILTER_TYPE_SOURCE      = 1U, /**< filter on source address */
} cy_en_ethif_filter_type_t;


/**
 *****************************************************************************
 ** \brief Total number of filters supported
 **
 *****************************************************************************/
typedef enum
{
    CY_ETHIF_FILTER_NUM_1 = 1U,          /**< filter 1 */
    CY_ETHIF_FILTER_NUM_2 = 2U,          /**< filter 2 */
    CY_ETHIF_FILTER_NUM_3 = 3U,          /**< filter 3 */
    CY_ETHIF_FILTER_NUM_4 = 4U,          /**< filter 4 */
    CY_ETHIF_FILTER_NUM_INV,            /**< Invalid Filter */
} cy_en_ethif_filter_num_t;


/**
 *****************************************************************************
 ** \brief Transmit Time stamp modes
 **
 *****************************************************************************/
typedef enum
{
    CY_ETHIF_TX_TS_DISABLED = 0U,
    CY_ETHIF_TX_TS_PTP_EVENT_ONLY = 1U,
    CY_ETHIF_TX_TS_PTP_ALL = 2U,
    CY_ETHIF_TX_TS_ALL = 3U,
} cy_en_ethif_TxTs_mode_t;


/**
 *****************************************************************************
 ** \brief Receive Time stamp modes
 **
 *****************************************************************************/
typedef enum
{
    CY_ETHIF_RX_TS_DISABLED = 0U,
    CY_ETHIF_RX_TS_PTP_EVENT_ONLY = 1U,
    CY_ETHIF_RX_TS_PTP_ALL = 2U,
    CY_ETHIF_RX_TS_ALL = 3U,
} cy_en_ethif_RxTs_mode_t;


/**
 *****************************************************************************
 ** \brief DMA data buffer length
 **
 *****************************************************************************/
typedef enum
{
    CY_ETHIF_DMA_DBUR_LEN_1 = 0U,            /**< Single burst */
    CY_ETHIF_DMA_DBUR_LEN_4 = 1U,            /**< Burst upto 4 */
    CY_ETHIF_DMA_DBUR_LEN_8 = 2U,            /**< Burst upto 8 */
    CY_ETHIF_DMA_DBUR_LEN_16 = 3U,           /**< Burst upto 16 */
} cy_en_ethif_dma_data_buffer_len_t;


/**
 *****************************************************************************
 ** \brief MDC clock divider
 **
 *****************************************************************************/
typedef enum
{
    CY_ETHIF_MDC_DIV_BY_8 = 0U,              /**< Divide by 8 */
    CY_ETHIF_MDC_DIV_BY_16 = 1U,             /**< Divide by 16 */
    CY_ETHIF_MDC_DIV_BY_32 = 2U,             /**< Divide by 32 */
    CY_ETHIF_MDC_DIV_BY_48 = 3U,             /**< Divide by 48 */
    CY_ETHIF_MDC_DIV_BY_64 = 4U,             /**< Divide by 64 */
    CY_ETHIF_MDC_DIV_BY_96 = 5U,             /**< Divide by 96 */
    CY_ETHIF_MDC_DIV_BY_128 = 6U,            /**< Divide by 128 */
    CY_ETHIF_MDC_DIV_BY_224 = 7U,            /**< Divide by 224 */
} cy_en_ethif_dma_mdc_clk_div_t;


/** \} group_ethif_enums */


/***************************************
*        Configuration Structures
***************************************/
/**
* \addtogroup group_ethif_data_structures
* \{
*/


/**
 *****************************************************************************
 ** \brief Wrapper Configuration
 *****************************************************************************/
typedef struct
{
    cy_en_ethif_speed_sel_t stcInterfaceSel;        /**< Interface selection for ENET */
    cy_en_ethif_clock_ref_t bRefClockSource;        /**< Reference clock selection */
    uint8_t u8RefClkDiv;                            /**< Actual division would be u8RefClkDiv + 1 */
} cy_stc_ethif_wrapper_config_t;


/**
 *****************************************************************************
 ** \brief Tx/Rx Queue status
 *****************************************************************************/
typedef struct
{
    bool bTxQueueDisable[CY_ETH_QS2_2 + 1];         /**< Tx Queue0-2 || 0: Queue Enabled, 1: Queue Disabled */
    bool bRxQueueDisable[CY_ETH_QS2_2 + 1];         /**< Rx Queue0-2 || 0: Queue Enabled, 1: Queue Disabled */
} cy_stc_ethif_queue_disablestatus_t;


/**
 *****************************************************************************
 ** \brief Virtual and physical addresses of DMA-addressable data buffer
 *****************************************************************************/
typedef struct
{
    uintptr_t vAddr;                /**< Virtual address */
    uintptr_t pAddr;                /**< Physical address */
}  cy_stc_ethif_buff_addr_t;


/**
 *****************************************************************************
 ** \brief Buffer status
 *****************************************************************************/
typedef struct
{
    cy_stc_ethif_buff_addr_t        cy_ethif_bufaddr;       /**< Buffer address as per requirement by Cadence driver */
    cy_en_ethif_buffer_status_t     enBufStatus;            /**< Buffer status */
} cy_stc_ethif_bufstatus_t;


/**
 *****************************************************************************
 ** \brief 1588 Timer value
 *****************************************************************************/
typedef struct
{
    /** Upper 16 bits of seconds value */
    uint16_t secsUpper;
    /** Lower 32 bits of seconds value */
    uint32_t secsLower;
    /** Upper Nanoseconds value (30 bits) */
    uint32_t nanosecs;
} cy_stc_ethif_1588_timer_val_t;


/**
 *****************************************************************************
 ** \brief writing/reading the 1588 timer increment registers
 *****************************************************************************/
typedef struct
{
    /** Whole nanoseconds to increment timer each clock cycle */
    uint8_t nanoSecsInc;
    /** Sub-nanoseconds to increment the timer (16 bits) */
    uint16_t subNsInc;
    /** Lower 8 bits of sub-nanoseconds to increment the timer */
    uint8_t lsbSubNsInc;
    /** Number of increments before changing to alternative increment. If = 0 then never use alternative increment. */
    uint8_t altIncCount;
    /** Alternative nanoseconds increment to apply */
    uint8_t altNanoSInc;
} cy_stc_ethif_timer_increment_t;


/** struct for writing/reading 1588 timer */
typedef struct
{
    cy_stc_ethif_1588_timer_val_t *pstcTimerValue;          /**< TSU Timer value     */
    cy_stc_ethif_timer_increment_t *pstcTimerIncValue;      /**< TSU Timer increment value   */
    bool bOneStepTxSyncEnable;                              /**< One step sync enable    */
    cy_en_ethif_TxTs_mode_t enTxDescStoreTimeStamp;         /**< Store Time stamp value in Tx descriptor */
    cy_en_ethif_RxTs_mode_t enRxDescStoreTimeStamp;         /**< Store Time stamp value in Rx descriptor */
    bool bStoreNSinRxDesc;                                  /**< Store NanoSecond field of TSU in Rx Descriptor  */
} cy_stc_ethif_tsu_config_t;


/**
 *****************************************************************************
 ** \brief Frame transmission complete callback function. Signals a successful
 **        completed transmission.
 **
 ** \param base[IN] Pointer to register area of Ethernet MAC
 ** \param u8Queue[IN] Queue used for transmitting the frame
 *****************************************************************************/
typedef void (*cy_ethif_tx_msg_cb_t)(ETH_Type *base, uint8_t u8QueueIndex);


/**
*****************************************************************************
** \brief Frame transmission Error callback function. Signals a transmission
**        error.
**
** \param base[IN] Pointer to register area of Ethernet MAC
** \param u8Queue[IN] Queue used for transmitting the frame
*****************************************************************************/
typedef void (*cy_ethif_tx_error_cb_t)(ETH_Type *base, uint8_t u8QueueIndex);


/**
*****************************************************************************
** \brief Frame received callback function. Signals a successful reception
**        of frame.
**
** \param base[IN] Pointer to register area of Ethernet MAC
** \param u8RxBuffer[IN] Receive frame buffer
** \param u32Length[IN] Frame buffer length
*****************************************************************************/
typedef void (*cy_ethif_rx_frame_cb_t)(ETH_Type *base, uint8_t * u8RxBuffer, uint32_t u32Length);


/**
*****************************************************************************
** \brief TSU Second counter increment callback function. Signals a One second
**        increment in the TSU.
**
** \param base[IN] Pointer to register area of Ethernet MAC
*****************************************************************************/
typedef void (*cy_ethif_tsu_inc_cb_t)(ETH_Type *base);

/**
 *****************************************************************************
 ** \brief Get Buffer callback function. Driver call this for getting free
 **        buffer for filling subsequent receive frame.
 **
 ** \param base[IN] Pointer to register area of Ethernet MAC
 ** \param u8RxBuffer[OUT] 32 bytes aligned Frame buffer
 ** \param u32Length[OUT] Frame buffer length
 *****************************************************************************/
typedef void (*cy_ethif_rx_getbuffer_cb_t)(ETH_Type *base, uint8_t **u8RxBuffer, uint32_t *u32Length);


/**
 *****************************************************************************
 ** \brief Pointer to a Buffer pool.
 *****************************************************************************/
typedef uint8_t *cy_ethif_buffpool_t[CY_ETH_DEFINE_TOTAL_BD_PER_RXQUEUE];

/**
 *****************************************************************************
 ** \brief Ethernet MAC call back handlers
 *****************************************************************************/
typedef struct
{
    cy_ethif_tx_msg_cb_t        txcompletecb;     /**< Transmit complete    */
    cy_ethif_tx_error_cb_t      txerrorcb;        /**< Tx Error    */
    cy_ethif_rx_frame_cb_t      rxframecb;        /**< Frame Received */
    cy_ethif_tsu_inc_cb_t       tsuSecondInccb;   /**< TSU timer Second counter incremented */
    cy_ethif_rx_getbuffer_cb_t  rxgetbuff;        /**< Get buffer for Receive Frame */
} cy_stc_ethif_cb_t;



/**
 *****************************************************************************
 ** \brief Ethernet MAC detailed configurations
 *****************************************************************************/
typedef struct
{
    bool bintrEnable;                                   /**< interrupts/events to enable on start   */
    cy_en_ethif_dma_data_buffer_len_t dmaDataBurstLen;  /**< fixed burst length for DMA data transfers */
    /**< bit4:0 amba_burst_length                                  */
    /**< 1xxxx: attempt use burst up to 16 (CY_ETHIF_DMA_DBUR_LEN_16)  */
    /**< 01xxx: attempt use burst up to  8 (CY_ETHIF_DMA_DBUR_LEN_8)   */
    /**< 001xx: attempt use burst up to  4 (CY_ETHIF_DMA_DBUR_LEN_4)   */
    /**< 0001x: always use single burst                            */
    /**< 00001: always use single burst    (CY_ETHIF_AMBD_BURST_LEN_1) */
    /**< 00000: best AXI burst up to 256 beats                     */
    uint8_t u8dmaCfgFlags;                              /**< DMA config register bits 24, 25 & 26.                   */
    /**< OR the following bit-flags to set corresponding bits -  */
    /**< CY_ETHIF_CFG_DMA_DISC_RXP,              */
    /**< CY_ETHIF_CFG_DMA_FRCE_RX_BRST,          */
    /**< CY_ETHIF_CFG_DMA_FRCE_TX_BRST        */
    cy_en_ethif_dma_mdc_clk_div_t mdcPclkDiv;           /**< divisor to generate MDC from pclk */
    /**< CY_ETHIF_MDC_DIV_BY_8 = 0       */
    /**< CY_ETHIF_MDC_DIV_BY_16 = 1      */
    /**< CY_ETHIF_MDC_DIV_BY_32 = 2      */
    /**< CY_ETHIF_MDC_DIV_BY_48 = 3      */
    /**< CY_ETHIF_MDC_DIV_BY_64 = 4      */
    /**< CY_ETHIF_MDC_DIV_BY_96 = 5      */
    /**< CY_ETHIF_MDC_DIV_BY_128 = 6     */
    /**< CY_ETHIF_MDC_DIV_BY_224 = 7     */
    uint8_t u8rxLenErrDisc;                             /**< enable discard of frames with length field error */
    uint8_t u8disCopyPause;                             /**< disable copying Rx pause frames to memory */
    uint8_t u8chkSumOffEn;                              /**< enable checksum offload operation */
    uint8_t u8rx1536ByteEn;                             /**< enable Rx of frames up to 1536 bytes */
    uint8_t u8rxJumboFrEn;                              /**< enable Rx of jumbo frames */
    uint8_t u8enRxBadPreamble;                          /**< enable Rx frames with non-standard preamble */
    uint8_t u8ignoreIpgRxEr;                            /**< ignore IPG rx_er (NetCfg b30) */
    uint8_t u8storeUdpTcpOffset;                        /**< u8storeUdpTcpOffset */
    uint8_t u8aw2wMaxPipeline;                          /**< Maximum number of outstanding AXI write requests,
                                                        * that can be issued by DMA via the AW channel.
                                                        * Must not be = 0 if using AXI as this would disable writes
                                                        */
    uint8_t u8ar2rMaxPipeline;                          /**< Maximum number of outstanding AXI read requests,
                                                        * that can be issued by DMA via the AR channel.
                                                        * Must not be = 0 if using AXI as this would disable reads
                                                        */
    uint8_t u8pfcMultiQuantum;                          /**< enable pfc multiple quantum (8 different priorities) */
    cy_stc_ethif_wrapper_config_t *pstcWrapperConfig;   /**< Configuration for Wrapper */
    cy_stc_ethif_tsu_config_t *pstcTSUConfig;           /**< Configuration for TSU */
    bool btxq0enable;                                   /**< Tx Q0 Enable    */
    bool btxq1enable;                                   /**< Tx Q1 Enable    */
    bool btxq2enable;                                   /**< Tx Q2 Enable    */
    bool brxq0enable;                                   /**< Rx Q0 Enable    */
    bool brxq1enable;                                   /**< Rx Q1 Enable    */
    bool brxq2enable;                                   /**< Rx Q2 Enable    */
    cy_ethif_buffpool_t *pRxQbuffPool[CY_ETH_DEFINE_NUM_RXQS]; /**< Rx Queues buffer pool 32 bytes aligned */
} cy_stc_ethif_mac_config_t;


/**
 ******************************************************************************
 ** \brief Interrupt configuration for Ethernet MAC
 ******************************************************************************/
typedef struct
{
    bool btsu_time_match;                  /**< Time stamp unit time match event */
    bool bwol_rx;                          /**< Wake on LAN event received */
    bool blpi_ch_rx;                       /**< LPI indication status bit change received */    /* TODO: LPI, wait for conclusion?    */
    bool btsu_sec_inc;                     /**< TSU seconds register increment */
    bool bptp_tx_pdly_rsp;                 /**< PTP pdelay_resp frame transmitted */
    bool bptp_tx_pdly_req ;                /**< PTP pdelay_req frame transmitted */
    bool bptp_rx_pdly_rsp;                 /**< PTP pdelay_resp frame received */
    bool bptp_rx_pdly_req;                 /**< PTP pdelay_req frame received */
    bool bptp_tx_sync;                     /**< PTP sync frame transmitted */
    bool bptp_tx_dly_req;                  /**< PTP delay_req frame transmitted */
    bool bptp_rx_sync;                     /**< PTP sync frame received */
    bool bptp_rx_dly_req;                  /**< PTP delay_req frame received */
    // bool bpcs_lp_page_rx;                  /** PCS auto-negotiation link partner page received */
    // bool bpcs_an_complete;                 /** PCS auto-negotiation has completed */
    bool bext_intr;                        /**< External input interrupt detected */
    bool bpause_frame_tx;                  /**< Pause frame transmitted */
    bool bpause_time_zero;                 /**< Pause time reaches zero or zeroq pause frame received */
    bool bpause_nz_qu_rx;                  /**< Pause frame with non-zero quantum received */
    bool bhresp_not_ok;                    /**< DMA hresp not OK */
    bool brx_overrun;                      /**< Rx overrun error */
    bool bpcs_link_change_det;             /**< Link status change detected by PCS */           /* TODO: PCS, wait for conclusion   */
    bool btx_complete;                     /**< Frame has been transmitted successfully */
    bool btx_fr_corrupt;                   /**< Tx frame corruption */
    bool btx_retry_ex_late_coll;           /**< Retry limit exceeded or late collision */
    bool btx_underrun;                     /**< Tx underrun */
    bool btx_used_read;                    /**< Used bit set has been read in Tx descriptor list */
    bool brx_used_read;                    /**< Used bit set has been read in Rx descriptor list */
    bool brx_complete;                     /**< Frame received successfully and stored */
    bool bman_frame;                       /**< Management Frame Sent */
} cy_stc_ethif_intr_config_t;


/**
 ******************************************************************************
 ** \brief Ethernet MAC Address
 ******************************************************************************/
typedef struct
{
    uint8_t byte[6];                       /**< 6 bytes MAC Address */
} cy_stc_ethif_mac_address_t;


/**
 ******************************************************************************
 ** \brief filter configuration for Ethernet MAC
 ******************************************************************************/
typedef struct
{
    cy_en_ethif_filter_type_t   typeFilter;   /**< typeFilter */
    cy_stc_ethif_mac_address_t  filterAddr;   /**< filterAddr */
    uint8_t                     ignoreBytes;  /**< e.g. ignoreBytes = 0x01 implies first byte received should not be compared.
                                                 * e.g. ignoreBytes = 0x03 implies first and second byte received should not be compared. */
} cy_stc_ethif_filter_config_t;


/** \} group_ethif_data_structures */


/** \} group_ethif_data_structures */

